import os
import threading
import time
from queue import Queue

from 任务流程.兵种或法术升级.完成兵种或法术升级 import 完成兵种或法术升级任务
from 任务流程.兵种或法术升级.打开研究面板 import 打开研究面板任务
from 任务流程.兵种或法术升级.打开要升级的兵种或法术 import 打开要升级的兵种或法术任务
from 任务流程.基础任务框架 import 任务上下文
from 任务流程.建筑升级 import 寻找建筑, 建筑升级任务
from 任务流程.建筑升级.升级普通建筑 import 升级普通建筑任务
from 任务流程.建筑升级.寻找建筑 import 建筑查找模式
from 任务流程.战宠升级 import 战宠升级任务
from 任务流程.战宠升级.寻找战宠小屋 import 寻找战宠小屋任务
from 任务流程.战宠升级.打开要升级的宠物 import 打开要升级的宠物任务
from 任务流程.检查图像 import 检查图像任务
from 数据库.任务数据库 import 任务数据库, 机器人设置
from 核心.op import op类
from 核心.核心异常们 import 图像获取失败
from 核心.键盘操作 import 键盘控制器
from 核心.鼠标操作 import 鼠标控制器
from 模块.检测.模板匹配器 import 模板匹配引擎
from 模块.雷电模拟器操作类 import 雷电模拟器操作类

雷电模拟器 = 雷电模拟器操作类(1)
上下文 = 任务上下文(
    机器人标志="测试",
    消息队列=Queue(),
    数据库=任务数据库(),
    停止事件=threading.Event(),
    继续事件=threading.Event(),
    置脚本状态=print,
    op=op类(),
    雷电模拟器=雷电模拟器,
    鼠标=鼠标控制器(雷电模拟器.取绑定窗口句柄()),
    键盘=键盘控制器(雷电模拟器.取绑定窗口句柄())
)


# 任务数据库().保存机器人设置("测试", 设置)

# 当前文件所在目录：任务流程
print(__file__)
当前目录 = os.path.dirname(__file__)
项目根目录 = os.path.dirname(当前目录)
模板库路径=os.path.join(项目根目录, "img")
print()

模板匹配引擎(图片库路径=模板库路径)
上下文.继续事件.set()
最大重试次数 = 3
当前次数 = 0

while 当前次数 < 最大重试次数:
    try:
        print(f"开始第 {当前次数 + 1} 次执行")

        上下文.op.绑定(雷电模拟器.取绑定窗口句柄的下级窗口句柄())
        上下文.鼠标 = 鼠标控制器(雷电模拟器.取绑定窗口句柄())
        上下文.键盘 = 键盘控制器(雷电模拟器.取绑定窗口句柄())

        检查图像任务(上下文).执行()

        # from 任务流程.建筑升级.升级普通建筑 import 升级普通建筑任务
        # 升级普通建筑任务(上下文).执行()
        # 寻找战宠小屋任务(上下文).执行()
        # 打开要升级的宠物任务(上下文,"猛蜥").执行()
        #建筑升级任务(上下文).执行()
        # 战宠升级任务(上下文).执行()
        打开研究面板任务(上下文).执行()
        打开要升级的兵种或法术任务(上下文).执行()
        完成兵种或法术升级任务(上下文).执行()
        # 如果能走到这里，说明成功
        print("任务执行成功")
        break

    except 图像获取失败 as e:
        当前次数 += 1

        print(f"第 {当前次数} 次失败，准备重试")

        上下文.op.安全清理()

        if 当前次数 >= 最大重试次数:
            print("超过最大重试次数，终止")
            raise

        # 给模拟器 / op 一点恢复时间
        time.sleep(1)

    finally:
        print("最终释放资源")
        上下文.op.安全清理()

print("结束测试")